Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ་ དྲི་མ་ མེད་པ འི་ གཟི་བརྗིད་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone King of the Splendor of the Stainless Moon.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དགྲ་ རབ་ཏུ་ འཇོམས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Conqueror of the Enemy.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Jñānaśrī.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དོན་ གྱི་ བློ་གྲོས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Arthamati.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྣམ་པར་ བསྒྲགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $826 Situated beyond that universe was a universe known as Vikhyāta.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དཔའ་བོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Hero.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $827 Situated beyond that universe was a universe known as Endowed with Qualities.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ རྒྱལ་པོ འི་ འོད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Guṇarājaprabha.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཤིན་ཏུ་ རྣམ་པར་ བསྒོམས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $828 Situated beyond that universe was a universe known as Extremely Trained.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མེ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Jewel Fire.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡིད་གཉིས་ མནན་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $829 Situated beyond that universe was a universe known as Subduer of Doubt.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡིད་གཉིས་ ཐམས་ཅད་ ཡང་དག་ པར་ འཇོམས་ འབྱུང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Source of the Vanquishing of Doubt.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ [101a] རྒྱལ་ཚབ་ མི་ འཇིགས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Abhaya.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $830 Situated beyond that universe was a universe known as Endowed with Qualities.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིམ་པ འི་ སྲས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Hereditary Offspring .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྒྲོན་མ་ འཛིན་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Lamp Holder.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཏོག་ གི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Crest King.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བཤེས་གཉེན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Mitra.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ མཆོག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $832 Situated beyond that universe was a universe known as Supreme Incense.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ པད་མ འི་ དཔལ་ འབྱུང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Source of Lotus Splendor.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡེ་ཤེས་ རབ་མཆོག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Jñānottama.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་ཟེར་ རབ་ བཏང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Great Radiance .

source: བཅོམ་ ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཐམས་ཅད་ བཤེས་གཉེན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Friend of All.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤྲིན་ཆེན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $834 Situated beyond that universe was a universe known as Mahāmegha.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བྱམས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Maitreya .

source: བཅོམ་ ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྐར་རྒྱལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Royal Star.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྣང་བ་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $835 Situated beyond that universe was a universe known as Luminous .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ པད་མ་ སྣང་བ འི་ འོད་ཟེར་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Lotus of Shining Light.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྤྱོད་པ་ ཁྱད་པར་ཅན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Special Action.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ [101b] ཏེ །_
en: Abiding and remaining present there, he taught the Dharma. [101.b]

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མངོན་དུ་ འཕགས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Clearly Superior.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ དབང་པོ འི་ གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $837 Situated beyond that universe was a universe known as Abode of the Powerful One.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མཐའ་ ཡ ས་ རྣམ་པར་ གནོན་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Anantavikrāmin.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བཤེས་གཉེན་ གྲགས་ ལྡན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Famed Friend.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྒྱ་མཚོ འི་ ལྷུན་པོ་ མངོན་དུ་ འཕགས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Superior Ocean Mountain.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དཀོན་མཆོག་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Ratnākara.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་ པ་ ཤཱཀྱ་ ཐུབ་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Śākyamuni.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དབང་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Indra.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མཐོང་བ་ དོན་ཡོད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Amoghadarśin .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དཔའ་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Glorious Courage.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་ པ་ ཐོགས་མེད་ དབྱངས་ ཀྱི་ ང་རོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Unimpeded Melodious Roar.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྟག་ ཏུ་ རབ་ བརྗོད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $842 Situated beyond that universe was a universe known as Constant Expression.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ དཔག་ ཏུ་ མེད་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Boundless Splendor of Qualities.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྒྲོགས་ བྱེད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Proclaimer.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཟས་ ཀྱི་ རྒྱལ་མཚན་ ཞེས་ [102a] བྱ་བ་ ཡོད་ དེ །_
en: $843 Situated beyond that universe was a universe known as Banner of Sustenance. [102.a]

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ ཙན་དན་ དྲི་བསུང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $844 Situated beyond that universe was a universe known as Sandalwood Fragrance .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དྲི་མ་ མེད་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Vimalaśrī.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདྲེན་པ འི་ རྒྱལ་མཚན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $845 Situated beyond that universe was a universe known as Guiding Banner.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྤྱན་ བཟངས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Excellent Eye.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ལག་ ན་ རིན་ཆེན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Ratnapāṇi.

source: བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ ལ་སོགས་པ་ སྐྱེ་བ་ གཅིག་ གིས་ ཐོགས་པ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ དོང་ སྟེ་ |#| ལྷགས་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ
en: $846 These and innumerably many other bodhisattvas who were also held back by just a single birth arrived in this way at the Kalandaka­nivāpa in the Veṇuvana by Rājagṛha. |#| Proceeding to the place where the Blessed One was residing, they bowed their heads to his feet.

source: བཅོམ་ལྡན་ འདས་ འབའ་ཞིག་ ལ་ ཕྱག་ འཚལ་ ཞིང་ ཕྱོགས་ གཅིག་ ཏུ་ འཁོད་ དོ །_།
en: Prostrating exclusively to the Blessed One, they then found their place in the gathering.

source: དེ འི་ ཚེ་ ལྷོ་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ འི་ མཛོད་ གཅིག་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: $847 At that time there resided in the south, beyond innumerable and unfathomable universes, a thus-gone one known as Single Jewel Treasury.

source: མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ མངོན་པར་ རྫོགས་པ ར་ འཚང་རྒྱ་བ ར་ འགྱུར་ རོ་ ཞེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱུ་སྐར་ གྱི་ ཕྲེང་བ་ ཞེས་ བྱ་བ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that after himself a bodhisattva great being by the name of Nakṣatravali would awaken to unsurpassable and perfect buddhahood.

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་ དཔའ་ ཆེན་པོ་ རྒྱུ་སྐར་ གྱི་ ཕྲེང་བ ས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ སྟེ །_ |#| གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ ནས་
en: Also this bodhisattva great being, Nakṣatravali, had noticed the great light and heard the clear voice.

source: བཅོམ་ལྡན་འདས་ དེ་ ལ་ ཞུས་པ །_
en: Now he approached that blessed one, asking,

source: བཅོམ་ལྡན་འདས་ གསུང་ བསལ་བ འི་ སྒྲ་ གྲག་པ་ དེ་ སུ འི་ ལགས །_
en: “Blessed One, whose is this clear voice that we hear?”

source: རྒྱུ་སྐར་ གྱི་ ཕྲེང་བ་ [102b] འདི་ ནས་ བྱང་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $848 “Nakṣatravali,” |#| “to the north of here, beyond innumerable and unfathomable universes, lies a universe known as Enduring.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ འདི་ལྟ་སྟེ །_ |#| བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ ཀྱི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཀྱི་ ཆོས་ ཀྱང་ སྟོན་ ཏོ །_།
en: Abiding and remaining present there, he is delivering Dharma teachings of the Bodhisattva Collection.

source: འཁོར་ དེར་ ཡང་ ཆོས་ མཉན་པ འི་ ཕྱིར་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ འི་ གོ་ཆ་ བགོས་པ་ དག་ འདུས་ ཏེ །_
en: In his retinue are bodhisattva great beings who bear an inconceivable armor. |#| They have arrived there to receive the teachings.

source: རྒྱུ་སྐར་ གྱི་ ཕྲེང་བ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གཞན་ ན་ ནི་ སེམས་ཅན་ རྣམས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ ཇི་ལྟ་བུ འི་ གོ་ཆ་ དག་ གིས་ གོ་ཆ་ བགོས་པ འི་ གོ་ཆ་ དེ་ལྟ་ བུ་ དག་ གིས་ སྟོངས་ སོ །_།
en: Nakṣatravali, in other worlds you will not find sentient beings who bear such an armor.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྒྱུ་སྐར་ གྱི་ ཕྲེང་བ ས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: said the bodhisattva great being Nakṣatravali,

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་ བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཤཱཀྱ་ ཐུབ་པ་ དེ་ ལ་ བལྟ་བ་ དང་ །_ ཕྱག་ བགྱི་བ་ དང་ །_ བསྙེན་བཀུར་ བགྱི་བ་ དང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ འི་ གོ་ཆ་ བགོས་པ་ དེ་དག་ བལྟ་བ འི་ སླད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: $849 “Blessed One,” |#| “I wish to go to that universe so that I may see, venerate, and serve the blessed one, the thus-gone one, the worthy one, the perfect buddha Śākyamuni, and so that I may behold the bodhisattvas who bear that inconceivable armor.”

source: ང འི་ ཚིག་ གིས་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ སྙུན་ གསོལ་ ལ །_
en: On my behalf, ask that blessed one whether he has encountered but little hardship or discomfort, and whether he remains healthy, strong, and at ease.

source: རིགས་ ཀྱི་ བུ་ ཁྱོད་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེར་ ཡང་ ཤེས་བཞིན་ དུ་ སྤྱོད་པ ར་ གནས་པ ར་ བྱོས་ ཤིག _།
en: But, noble son, act with mindfulness in that buddha realm.

source: སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ ནི་ བསྙེན་པ ར་ དཀའ་བ འི་ ཕྱིར་ རོ །_།
en: Because, noble son, the bodhisattva great beings of that realm are hard to approach.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱུ་སྐར་ གྱི་ ཕྲེང་བ ས་ བཅོམ་ ལྡན་འདས་ དེ འི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ །_ |#| བསྐོར་བ་ ཡང་ བྱས་ ནས་ སོང་ སྟེ །_
en: $851 The bodhisattva Nakṣatravali then prostrated to the feet of that blessed one, circumambulated him, and left.

source: དེ་ འདི་ལྟ་སྟེ་ དཔེར་ན །_ སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ལག་པ་ བསྐུམ་པ་ རྐྱོང་བ ར་ བྱེད་པ འམ །_ ལག་པ་ བརྐྱང་བ་ སྐུམ་པ ར་ བྱེད་པ འི་ སྐད་ཅིག་ དེས་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ནས་ མི་སྣང་བ ར་ [103a] གྱུར་ ནས་ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འདུག་ སྟེ
en: As fast as an athlete can stretch out or bend an arm, the bodhisattva Nakṣatravali now disappeared from that universe [103.a] and emerged here in the world of Enduring.

source: དེ་ རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ །_ |#| བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: Arriving at the Kalandaka­nivāpa in the Veṇuvana by Rājagṛha, he bowed his head to the feet of the Blessed One and said,

source: བཅོམ་ ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ འི་ མཛོད་ གཅིག་པ་ སྙུན་ གསོལ་ ལགས་སོ །_།
en: “Blessed One, the thus-gone Single Jewel Treasury inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱུ་སྐར་ གྱི་ ཕྲེང་བ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: answered the Blessed One to the bodhisattva Nakṣatravali,

source: རིགས་ ཀྱི་ བུ་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་ སྙུན་ མི་ མངའ་ འམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ བདེ་བ་ དང་ ལྡན་ ནམ །_ འགྱུར་བ་ མི་ མངའ་ འམ །_
en: $852 “Noble son,” |#| “is that blessed one free from harm, is he strong, and does he remain unchanged and at ease?”

source: བྱང་ ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དེ་ ལ་སོགས་པ་ སྐྱེ་བ་ གཅིག་ གིས་ ཐོགས་པ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ ལྷོ་ཕྱོགས་ ནས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཐ་དད་པ་ དག་ ཏུ་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ དོང་ སྟེ་ |#| ཕྱིན་ ནས
en: $853 Innumerably and unfathomably many other bodhisattva great beings, who like Nakṣatravali were held back by a just a single birth, similarly arrived from the south at the place where the Blessed One was residing.

source: བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འཁོད་ དོ །_།
en: They bowed their heads to the Blessed One’s feet and found their place in the gathering.

source: དེ འི་ ཚེ་ ནུབ་ཕྱོགས་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སྐྱེ་བ་ གཅིག་ གིས་ ཐོགས་པ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ དོང་ སྟེ་ ལྷགས་ ནས །_
en: $854 Innumerably and unfathomably many other bodhisattva great beings, who also were held back by just a single birth, similarly arrived from the west at the place where the Blessed One was residing.

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ རྡུལ་མེད་ རྡུལ་བྲལ་ རྣམ་གྲོལ་ འདས་པ་ དང་ །_ མ་འོངས་པ་ དང་ །_ ད་ལྟ ར་ བྱུང་བ་ ལ་མ་ ཆགས་པ འི་ གོ་ཆ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ནས་ དེ་དག་ གི་ དང་པོ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཁྱུ་མཆོག་ མཐའ་ ཡ ས་ སངས་རྒྱས་ ཀྱི་ མེ་ཏོག་ ཀུན་ ཏུ་ སྟོན་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ རྣམས་ དང་ ལྷན་ཅིག་ ཏུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ་ ག་ལ་བ་ དེར་ སོང་ སྟེ
en: $855 From the buddha realm of the blessed thus-gone Armor of Transcendent and Stainless Liberation Who Is Free from Hindrances regarding Past, Future, and Present arrived the bodhisattva Infinite Leader with the Armor of Revealing the Flower of Buddhahood, accompanied by innumerably and unfathomably many bodhisattva great beings. |#| As this bodhisattva arrived in the world of Enduring, he proceeded to the place where the blessed thus-gone Śākymuni was residing.

source: བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ནས །_
en: Having bowed his head to the Blessed One’s feet,

source: [103b] གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ ཞེས་ སྙུན་ གསོལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_།
en: he inquired whether the Blessed One had encountered but little harm and distress [103.b] and then sat to one side.

source: རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཀྱིས་ དོན་ གྱི་ དབང་ ཅི་ མཐོང་ ནས་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འོངས །_
en: $856 “Noble son,” |#| “what purpose did you perceive in coming to this world of Enduring?”

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ འི་ བྱིན་ གྱི་ རླབས་ ཀྱིས་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདིར་ མཆིས་ ལགས་ མོད་ ཀྱི །_
en: $857 “Blessed One,” |#| “I have come to this place by the blessing of the thus-gone ones.

source: འོན་ཀྱང་ བཅོམ་ལྡན་འདས་ བདག་ ནི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ཉིད་ ན་ མཆིས་ ཀྱང་ །_
en: But, Blessed One, although I am present in this universe,

source: འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ མཐོང་ ཞིང་ དེ་བཞིན་ གཤེགས་པ་ ཐམས་ཅད་ དང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ ཐམས་ཅད་ ཀྱང་ མཐོང་ ལགས་ ཏེ །_
en: I still perceive all other realms of the world. |#| I see all the thus-gone ones and I see all the bodhisattvas.

source: བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ནི་ འདི་ སྙམ་ དུ་ བདག་ཅག་ འཇིག་རྟེན་ གྱི་ ཁམས་ གཞན་ དུ་ འདོང་བ ར་ བྱ འོ །_། |#| དེ་བཞིན་ གཤེགས་པ་ གཞན་ ཡང་ བལྟ་བ ར་ བྱ འོ །_། |#| སྙམ་ དུ་ མི་ སེམས་ ལགས་སོ །_།
en: Bodhisattvas do not think, ‘We should go to a different universe. |#| We should meet another thus-gone one.’

source: བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ ནི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་དག་ ཉིད་ ན་ མཆིས་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ ཐམས་ཅད་ མཐོང་ ལགས་ ཏེ །_
en: Because they remain in one world, yet perceive all thus-gone ones.

source: བཅོམ་ལྡན་འདས་ དེ འི་ སླད་ དུ་ དེ་བཞིན་ གཤེགས་པ འི་ ཐུགས་བསྐྱེད་པ་ ཙམ་ གྱིས་ དེ་བཞིན་ གཤེགས་པ འི་ མཐུ ས་ བདག་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདིར་ མཆིས་ ལགས་སོ །_།
en: Thus, Blessed One, it is simply due to the thus-gone ones’ cultivation of the mind of awakening, and because of their powers, that we have arrived in this universe.

source: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་དག་ མཆི་བ་ དེ་དག་ ཀྱང་ །_ དེ་བཞིན་ གཤེགས་པ འི་ སྔོན་ གྱི་ སྨོན་ལམ་ གྱི་ དབང་ གིས་ དེ་བཞིན་ གཤེགས་པ འི་ མཐུ ས་ མཆིས་ ལགས་སོ །_།
en: All the other bodhisattvas who are present here have likewise arrived due to the past aspirations of the thus-gone ones, and because of their powers.”

source: དེ འི་ ཚེ་ ནུབ་ཕྱོགས་ ནས་ དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི འི་ མེ་ཏོག་ གི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དང་ །_ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི འི་ འོད་ དང་ །_ བཀོད་པ་ དཔག་མེད་ དང་ །_ འོད་ཟེར་ དཔག་མེད་ དང་ །_ འོད་ དཔག་མེད་ དང་ །_ ཁྱུ་མཆོག་ དཔག་མེད་ དང་ །_ རྣམ་པར་ གནོན་པ་ དཔག་མེད་ དང་ །_ རྒྱུ་སྐར་ གཅིག་པ་ དང་ །_ རྒྱུ་སྐར་ གྱི་ ཕྲེང་བ་ དང་ །_ རིན་ཆེན་ གདུགས་ དང་ །_ རྒྱུ་སྐར་ རྒྱལ་པོ་ དང་ །_ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ ཅན་ དང་ །_ འོད་ ཀྱི་ རྒྱལ་པོ་ དང་ །_ འོད་ཟེར་ མངོན་པར་ འཕགས་པ འི་ དཔལ་ དང་ །_ འོད་ཟེར་ མཐའ་ ཡ ས་ དང་ །_ ཁྱུ་མཆོག་ དང་ །_ ཁྱུ་མཆོག་ མཐའ་ ཡ ས་ རྣམ་ [104a] པར་ གནོན་ དང་ །_ ཐོགས་པ་ མེད་པ འི་ དབྱངས་ དང་ །_ སྤྲིན་ཆེན་ འོད་ཟེར་ དང་ །_ དྲ་བ་ ཅན་ གྱི་ འོད་ཟེར་ དང་ །_ སངས་རྒྱས་ མེ་ཏོག་ འོད་ཟེར་ དང་ །_ པད་མ འི་ ཁྱུ་མཆོག་ མེ་ཏོག་ དང་ །_ རི འི་ རྒྱལ་པོ་ དང་ །_ ཟླ་བ འི་ ཡོན་ཏན་ བདག་པོ་ དང་ །_ འོད་ཟེར་ རབ་ཏུ་ བཏང་བ་ དང་ །_ དཔུང་མགོ་ ཤིན་ཏུ་ ཟླུམ་པ་ དང་ །_ མཐོང་བ་ དོན་ཡོད་ དང་ །_ རྩེ་མོ་ མངོན་པར་ འཕགས་པ འི་ རྒྱལ་པོ་ དང་ །_ པད་མ འི་ རྩེ་མོ་ མངོན་པར་ འཕགས་པ འི་ རྒྱལ་པོ་ དང་ །_ དེ་བཞིན་ གཤེགས་པ་ དེ་དག་ ལ་སོགས་པ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དག་ ནས |#| བྱང་ཆུབ་ སེམས་དཔའ་ སྐྱེ་བ་ གཅིག་ གིས་ ཐོགས་པ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ ལྷགས་ ཏེ །_ |#| ལྷགས་ ནས་ ཀྱང་
en: $858 Now arrived innumerably and unfathomably many other bodhisattvas, all held back by just a single birth, from the western buddha realms of thus-gone ones such as Nectar Flower, Nectar Light, Unfathomable Array, Unfathomable Light Rays, Amitābha, Unfathomable Leader, Unfathomable Subduer, Single Heavenly Body, Nakṣatravali , Ratnacchatra, Tārarāja, Luminous Disk, King of Light , Splendor of Superior Light Rays, Infinite Light Rays, Vṛṣabha, Subjugating Infinite Leader, [104.a] Unhindered Melody, Light Rays of Great Clouds, Jālinīprabha , Light Rays of the Buddha Flower, Flower of the Lotus Leader, King of Mountains , Lord of Moon Qualities, Great Radiance , Susaṃ­vṛttas­kandha, Amoghadarśin , King of the High Summit, and King of the High Lotus Summit. |#| Arriving in the world of Enduring,

source: རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ དོང་ སྟེ་
en: they proceeded to the Kalandaka­nivāpa in the Veṇuvana by Rājagṛha and the place where the Blessed One was residing.

source: བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་ མགོ་ བོས་ ཕྱག་ འཚལ་ ནས་ |#| ཕྱོགས་ གཅིག་ ཏུ་ འཁོད་ དོ །_།
en: There they bowed their heads to the Blessed One’s feet and sat to one side.

source: དེ འི་ ཚེ་ བྱང་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྒྱུ་སྐར་ གྱི་ ཕྲེང་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $859 At that time there was in the north, beyond innumerable and unfathomable universes, a universe known as Nakṣatravali .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དོན་ཡོད་ མིང་ སྒྲོགས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Propagator of the Meaningful Name.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཕྱིར་ མི་ ལྡོག་པ འི་ འཁོར་ལོ་ བསྐོར་བ ར་ ངེས་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that a bodhisattva known as Definite Armor of Turning the Irreversible Dharma Wheel Immediately upon Rousing the Mind would awaken to unsurpassable and perfect buddhahood.

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེས་ སྣང་ བ་ ཆེན་པོ་ དེ་ མཐོང་ ཞིང་ གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ ནས །_
en: That bodhisattva had also noticed the great light and heard the sound of the clear voice.

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དོན་ཡོད་ མིང་ སྒྲོགས་ དེ་ ལ་ དེས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: He therefore went before the blessed Propagator of the Meaningful Name and asked,

source: བཅོམ་ལྡན་འདས་ འོད་ ཀུན་ དུ་ གདའ་བ་ དང་ །_ གསུང་ བསལ་བ འི་ སྒྲ་ གྲག་པ་ དེ་དེ་ བཞིན་ གཤེགས་པ་ གང་ གི་ ལགས །_
en: “Blessed One, to which thus-gone one does this omnipresent light and clear voice belong?”

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཕྱིར་ མི་ ལྡོག་པ འི་ འཁོར་ལོ་ བསྐོར་བ ར་ ངེས་པ འི་ གོ་ཆ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: replied the Blessed One,

source: རིགས་ ཀྱི་ བུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འདི་ ནས་ ལྷོ་ཕྱོགས་ [104b] སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $860 “Noble son,” |#| “to the south of this buddha realm, [104.b] beyond innumerable and unfathomable universes, lies a universe known as Enduring.

source: སྣང་བ་ དེ་ དང་ །_ གསུང་ བསལ་བ འི་ སྒྲ་ གྲག་པ་ དེ་ ནི་ དེ འི་ ཡིན་ ནོ །_།
en: His is the light and the clear voice.

source: སངས་རྒྱས་ ཀྱི་ ཞིང་ དེར་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ འི་ གོ་ཆ་ བགོས་པ་ དག་ སྐྱེས་ ཏེ །_
en: Bodhisattvas who bear an inconceivable armor have taken birth in that buddha realm, and

source: དེ་དག་ གིས་ མིང་ བརྗོད་པ་ ཙམ་ གྱིས་ ཕྱོགས་ བཅུ འི་ བྱང་ཆུབ་ སེམས་ དཔའ་ རྣམས་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ངེས་པ ར་ འགྱུར་ རོ །_།
en: merely pronouncing their names will destine the bodhisattvas in the ten directions for certain unsurpassable and perfect awakening.”

source: དེ་བཞིན་ གཤེགས་པ་ དོན་ཡོད་ མིང་ སྒྲོགས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཕྱིར་ མི་ ལྡོག་པ འི་ འཁོར་ལོ་ བསྐོར་བ ར་ ངེས་པ འི་ གོ་ཆ ས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: said the bodhisattva Definite Armor of Turning the Irreversible Dharma Wheel Immediately upon Rousing the Mind to the thus-gone Propagator of the Meaningful Name,
